#define  _CRT_SECURE_NO_WARNINGS


//【程序1】
//题目：有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
//1.程序分析：可填在百位、十位、个位的数字都是1、2、3、4。组成所有的排列后再去掉不满足条件的排列。
#include<stdio.h>
//#include<conio.h>
int main()
{
	int i, j, k;
	printf("\n");
	for (i = 1; i < 5; i++)
	{
		for (j = 1; j < 5; j++)
		{
			for (k = 1; k < 5; k++)
			{
				if (i != k && i != j && j != k)
					printf("%d,%d,%d\n", i, j, k);
			}
			getchar();
		}
	}
	return 0;
}


//【程序2】
//题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10% ；
//利润高于10万元，低于20万元时，低于10万元的部分按10% 提成，高于10万元的部分，可可提成7.5 % ；
//20万到40万之间时，高于20万元的部分，可提成5 % ；40万到60万之间时高于40万元的部分，可提成3 % ；
//60万到100万之间时，高于60万元的部分，可提成1.5 % ，高于100万元时，超过100万元的部分按1 % 提成，
//从键盘输入当月利润I，求应发放奖金总数？
//1.程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

# include < stdio.h > 
int main()
{
	long int i;
	int b1, b2, b3, b4, b5, b6; 
	scanf(" % ld ", &i);
	b1 = 100000 * 0.1;//<=10W
	b2 = b1 + 100000 * 0.075;// 10w~20w
	b3 = b2 + 200000 * 0.05;// 20w~40W
	b4 = b3 + 200000 * .03;// 40w~60w
	b5 = b4 + 400000 * 0.015;// 60w~100w
	b6 = b5 + (i - 1000000) * 0.01; // > 100w 
	if (i <= 100000)
		printf("%d\n", b1);
	else if (i <= 200000)
		printf("%d\n", b2);
	else if (i <= 400000)
		printf("%d\n", b3);
	else if (i = 600000)
		printf("%d\n", b4);
	else if (i <= 1000000)
		printf("%d\n", b5);
	else
		printf("%d\n", b6);
		
	return 0;
}
